In [5]:
import pandas as pd

# Sorting Data

In [6]:
# Sample DataFrame
df = pd.DataFrame({
    "Name": ["Onkar", "Amit", "Sara", "Rohit"],
    "Age": [21, 25, 23, 29],
    "Salary": [50000, 65000, 55000, 70000],
    "City": ["Pune", "Mumbai", "Nashik", "Pune"]
})

df

    Name  Age  Salary    City
0  Onkar   21   50000    Pune
1   Amit   25   65000  Mumbai
2   Sara   23   55000  Nashik
3  Rohit   29   70000    Pune

## 1. Sort by a Single Column â€”> `.sort_values()`

In [7]:
# Sort Salary (Ascending - Default)
df.sort_values("Salary")

    Name  Age  Salary    City
0  Onkar   21   50000    Pune
2   Sara   23   55000  Nashik
1   Amit   25   65000  Mumbai
3  Rohit   29   70000    Pune

In [8]:
# Descending
df.sort_values("Salary", ascending=False)

    Name  Age  Salary    City
3  Rohit   29   70000    Pune
1   Amit   25   65000  Mumbai
2   Sara   23   55000  Nashik
0  Onkar   21   50000    Pune

## 2. Sort by multiple columns

In [10]:
#Sort by City Then Salary
df.sort_values(["City", "Salary"])

    Name  Age  Salary    City
1   Amit   25   65000  Mumbai
2   Sara   23   55000  Nashik
0  Onkar   21   50000    Pune
3  Rohit   29   70000    Pune

In [11]:
# Different order for each column
df.sort_values(["City", "Salary"], ascending=[True, False])

    Name  Age  Salary    City
1   Amit   25   65000  Mumbai
2   Sara   23   55000  Nashik
3  Rohit   29   70000    Pune
0  Onkar   21   50000    Pune

## 3. Sort with missing values

In [12]:
df.sort_values("Salary", na_position="last")

    Name  Age  Salary    City
0  Onkar   21   50000    Pune
2   Sara   23   55000  Nashik
1   Amit   25   65000  Mumbai
3  Rohit   29   70000    Pune

In [13]:
df.sort_values("Salary", na_position="first")

    Name  Age  Salary    City
0  Onkar   21   50000    Pune
2   Sara   23   55000  Nashik
1   Amit   25   65000  Mumbai
3  Rohit   29   70000    Pune

## Sort index -> `sort_index()`

In [14]:
df.sort_index()

    Name  Age  Salary    City
0  Onkar   21   50000    Pune
1   Amit   25   65000  Mumbai
2   Sara   23   55000  Nashik
3  Rohit   29   70000    Pune

In [16]:
df.sort_index(ascending=False)

    Name  Age  Salary    City
3  Rohit   29   70000    Pune
2   Sara   23   55000  Nashik
1   Amit   25   65000  Mumbai
0  Onkar   21   50000    Pune

In [18]:
ex = df.sort_values("Salary", ascending=False)
ex

    Name  Age  Salary    City
3  Rohit   29   70000    Pune
1   Amit   25   65000  Mumbai
2   Sara   23   55000  Nashik
0  Onkar   21   50000    Pune

In [20]:
ex.sort_index(ascending=False)

    Name  Age  Salary    City
3  Rohit   29   70000    Pune
2   Sara   23   55000  Nashik
1   Amit   25   65000  Mumbai
0  Onkar   21   50000    Pune

## 5. Sort After setting index

In [21]:
df_indexed = df.set_index("Name")
df_indexed.sort_index()

       Age  Salary    City
Name
Amit    25   65000  Mumbai
Onkar   21   50000    Pune
Rohit   29   70000    Pune
Sara    23   55000  Nashik

## 6. Sort and Save Result

Original Data Fame

In [22]:
df

    Name  Age  Salary    City
0  Onkar   21   50000    Pune
1   Amit   25   65000  Mumbai
2   Sara   23   55000  Nashik
3  Rohit   29   70000    Pune

Saves the descending ordered DF in df2 or we can also assign to df instead of `inplace=True`

In [24]:
# 
df2 = df.sort_values("Salary", ascending=False)
df2

    Name  Age  Salary    City
3  Rohit   29   70000    Pune
1   Amit   25   65000  Mumbai
2   Sara   23   55000  Nashik
0  Onkar   21   50000    Pune

Used `inplace=True` and the changes are made in original df

In [26]:
df.sort_values("Salary", ascending=False, inplace=True)
df

    Name  Age  Salary    City
3  Rohit   29   70000    Pune
1   Amit   25   65000  Mumbai
2   Sara   23   55000  Nashik
0  Onkar   21   50000    Pune

Reset the index and droped the previous index

In [28]:
df.reset_index(drop=True)

    Name  Age  Salary    City
0  Rohit   29   70000    Pune
1   Amit   25   65000  Mumbai
2   Sara   23   55000  Nashik
3  Onkar   21   50000    Pune

---

# Summary
1. `df.sort_values("col_name")` - Sorts in ascending order
2. `.sort_values("col_name", ascending=False)` - Sorts in descending order
3. `.sort_values(["col1", "col2"])` - Sort by multiple columns -- First col1 then col2
4. `.sort_values(["col1", "col2",....], ascending=[True, False,....])` - Diff orer for diff columns
5. `.sort_values("col_name", na_position="last" / "first")` - Missing values either at first or last
6. `.sort_index()` - Ascending & `.sort_index(ascending=False)` Descending
7. `.sort_values("col_name", implace=True)` - Changes in original Data Frame